Catalogs/Предприятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Предприятие</Name>
			<Comment>Структура предприятия</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Холдер</Name>
					<Comment>Организация которой принадлежит рабочее место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Холдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхКанал</Name>
					<Comment>Канал для внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхЗапись</Name>
					<Comment>Состояние записи внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхЗапрет</Name>
					<Comment>Запрет или разрешение на выполнение внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние элемента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЭлементаПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Точка размещения группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Наименование элемента и его принадлежность</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОПропущенных</Name>
					<Comment>Оповещать о пропущенных звонках по эл.почте</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Текущий непосредтвенный руководитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОУ</Name>
					<Comment>Текущий сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОУ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Снилс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СотрудникиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОУ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РуководителиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Руководитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелевыеТочкиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОбъектыПривязка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыПривязка</Name>
			<Comment>Привязка объектов к элементам предприятия</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Comment>Владелец объекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелМобильные</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостояниеЭлементаПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>СостояниеЭлементаПредприятия</Name>
			<Comment>Состояние элемента предприятия</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служебный</Name>
					<Comment>Служебный элемент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключен</Name>
					<Comment>Неактивный элемент</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Предприятие/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,ТекстЗаполнения,СтандартнаяОбработка)

// Если в параметре "ДанныеЗаполнения" содержится структура и в ней есть реквизит "Родитель", то
// попытаемся заполнить некоторые реквизиты нового элемента данными на основании "Родителя"
//-------------------------------------------------------------------------------------------------
	Доступно = (ТипЗнч(ДанныеЗаполнения) = Тип("Структура"));
	Доступно = Доступно И (ДанныеЗаполнения.Свойство("Родитель") = Истина);

	Если (Доступно = Истина) Тогда
		ЭтотОбъект.Родитель = ДанныеЗаполнения.Родитель;
		ЭтотОбъект.Холдер = ДанныеЗаполнения.Родитель.Холдер;
		ЭтотОбъект.ТочкаРазмещения = ДанныеЗаполнения.Родитель.ТочкаРазмещения;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)

// Если текущий объект является группой
// Если у группы запрещены исходящие внешние звонки, то отключим проверку реквизита "ИсхКанал"
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Истина) Тогда
		Если (ЭтотОбъект.ИсхЗапрет = Истина) Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИсхКанал"));
			ЭтотОбъект.ИсхЗапись = Ложь;

// Если же у группы разрешены исходящие внешние звонки, но реквизит "ИсхКанал" не заполнен, то
// попытаемся заполнить его из настроек вышестоящей группы
//-------------------------------------------------------------------------------------------------
		ИначеЕсли (НЕ ЗначениеЗаполнено(ЭтотОбъект.ИсхКанал)) Тогда
			ТекРодитель = ЭтотОбъект.Родитель;

			Пока (ЗначениеЗаполнено(ТекРодитель)) Цикл
				Если (ЗначениеЗаполнено(ТекРодитель.ИсхКанал)) Тогда
					ЭтотОбъект.ИсхКанал = ТекРодитель.ИсхКанал;
					Прервать;
				КонецЕсли;

				ТекРодитель = ТекРодитель.Родитель;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

// Если текущий объект - линейный элемент, то убедимся в том, что он принадлежит группе
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Ложь) Тогда
		Если (НЕ ЗначениеЗаполнено(ЭтотОбъект.Родитель)) Тогда
			Сообщить("Линейное рабочее место должно обязательно принадлежать группе (подразделению)");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

// Выполним нормализацию реквизитов
//-------------------------------------------------------------------------------------------------
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);
	ЭтотОбъект.НаименованиеПолное = СокрЛП(ЭтотОбъект.ПолноеНаименование());

// Если текущий объект является линейным элементом
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Ложь) Тогда
		Если (ЭтотОбъект.Состояние = Перечисления.СостояниеЭлементаПредприятия.РабочееМесто) Тогда
			Темп = СокрЛП(ЭтотОбъект.ПолноеНаименование()) + "/" + СокрЛП(ЭтотОбъект.Должность);
			ЭтотОбъект.Должность = СокрЛП(ЭтотОбъект.Должность);
			ЭтотОбъект.НаименованиеПолное = СокрЛП(Темп);
		Иначе
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Должность"));
			ЭтотОбъект.Должность = "";
		КонецЕсли;

		ЭтотОбъект.ТочкаРазмещения = ЭтотОбъект.Родитель.ТочкаРазмещения;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтотОбъект.ПроверитьЗаполнение()) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Если пытаются переименовать существующий элемент - отказать (только через обработку)
	//-------------------------------------------------------------------------------------
	Доступно_0 = Не ЭтоНовый();
	Доступно_0 = Доступно_0 И НЕ ЭтоГруппа;
	Доступно = Не Константы.РазрешеноПереименованиеВСправочникеПредприятие.Получить() И Доступно_0;  
	
	Если Доступно Тогда
		Если Наименование <> Ссылка.Наименование Тогда
			Сообщить("Переименовывать запрещено");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
// Если текущий элемент является группой, то перезапишем все подчиненные группы и элементы
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Истина) Тогда
		Выборка = Справочники.Предприятие.Выбрать(ЭтотОбъект.Ссылка);

		Пока (Выборка.Следующий()) Цикл
			Выборка.ПолучитьОбъект().Записать();
		КонецЦикла;
	КонецЕсли;
	
// Если запись выполняется при записи сотрудника ОУ, тогда не перезаписывать внутренние телефоны
//-------------------------------------------------------------------------------------------------
	РежимЗагрузкиСотрудниковУО = Ложь;
	Доступно = ДополнительныеСвойства.Свойство("ЗагрузиСотрудниковОУ", РежимЗагрузкиСотрудниковУО);
	Если Доступно Тогда
		Возврат;
	КонецЕсли;

// Перезапишем все подчиненные внутренние телефоны (корректировка функции записи исходящих)
//-------------------------------------------------------------------------------------------------
	СтрПараметры = Новый Структура("Владелец",ЭтотОбъект.Ссылка);
	Выборка = РегистрыСведений.ОбъектыПривязка.Выбрать(СтрПараметры);

	Пока (Выборка.Следующий()) Цикл
		Если (ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.ТелВнутренние")) Тогда
			// С 18.11.2019 не пишем в Abonents
			//Выборка.Объект.ПолучитьОбъект().Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
